package com.example.movieapplication.model

import android.os.Parcelable
import kotlinx.android.parcel.Parcelize

@Parcelize
data class Movie(val id: Long = 0,
                 val movieTitle: String? = getDefaultTitle(),
                 val movieGenre: String?= getDefaultGenre(),
                 val yearOfRelease: Int? = 0,
                 val movieDuration: Int? = 0,
                 val overview: String? = "")
        : Parcelable{
}

fun getDefaultGenre() = "Жанр"

fun getDefaultTitle() = "Название фильма"

fun getHorrorMovies() = mutableListOf(
            Movie(274,"Молчание ягнят", "ужасы", 1991,114, ""),
            Movie(9003,"Восставший из ада", "ужасы", 1987,93),
            Movie(19614,"Оно", "ужасы", 1990,135),
            Movie(138843,"Заклятие", "ужасы", 2013,112),
            Movie(49018,"Астрал", "ужасы", 2010,103),
            Movie(447332,"Тихое место", "ужасы", 2018,90),
            Movie(68315,"Мгла", "ужасы", 2017,126),
            Movie(565,"Звонок", "ужасы", 2002,115),
            Movie(9378,"Триннадцать привидений", "ужасы", 2001,91),
            Movie(13515,"Зеркала", "ужасы", 2008,110),
            Movie(270303, "Оно идет", "ужасы", 2014,96),
            Movie(555974,"Кукла 2", "ужасы", 2020,98)
    )


fun getThrillerMovies() = mutableListOf(
            Movie(210577,"Исчезнувшая", "триллеры", 2014,149),
            Movie(27205,"Начало", "триллеры", 2010,148),
            Movie(478820,"Видок", "триллеры", 2018,127),
            Movie(1124,"Престиж", "триллеры", 2006,125),
            Movie(591,"Код да Винчи", "триллеры", 2006,149),
            Movie(207933,"Обитель порклятых", "триллеры", 2014,112),
            Movie(4553,"Машинист", "триллеры", 2003,97),
            Movie(185,"Заводной апельсин", "триллеры", 1971,137),
            Movie(9963,"Предчуствие", "триллеры", 2007,96),
            Movie(11324,"Остров проклятых", "триллеры", 2010,138),
            Movie(622,"Девятые врата", "триллеры", 1999,133),
            Movie(22825,"Посылка", "триллеры", 2009,115)
    )


fun getComedyMovies() = mutableListOf(
            Movie(2330,"Такси", "комедии", 1998,86),
            Movie(120467,"Отель Гранд Будапешт", "комедии", 2014,100),
            Movie(246741,"Реальные упыри", "комедии", 2014,86),
            Movie(18785,"Мальчишник в Вегвсе", "комедии", 2009,96),
            Movie(337404,"Круэлла", "комедии", 2021,100),
            Movie(771,"Один дома", "комедии", 1990,103),
            Movie(3049,"Эйс Вентура", "комедии", 1993,86),
            Movie(11008,"Майор Пэйн", "комедии", 1995,95),
            Movie(854,"Маска", "комедии", 1994,100),
            Movie(9352,"Евротур", "комедии", 2004,90),
            Movie(20871,"Джентельмены удачи", "комедии", 1971,84),
            Movie(496,"Борат", "комедии", 2006,84)
    )


fun getSerials() =  mutableListOf(
            Movie(19995,"Аватар", "фантастика", 2009, 162),
            Movie(9947,"Электра", "фантастика", 2005, 97),
            Movie(603,"Матрица", "фантастика", 1999, 136),
            Movie(37924,"Суинни Тодд", "фантастика", 2006, 90),
            Movie(157336,"Интерстеллар", "фантастика", 2014, 169),
            Movie(241259,"Алиса в Зазеркалье", "фантастика", 2016, 112),
            Movie(2668,"Сонная лощина", "фантастика", 1999, 105),
            Movie(62213,"Мрачные тени", "фантастика", 2012, 103),
            Movie(335983,"Веном", "фантастика", 2018, 102),
            Movie(283366,"Дом странных детей мисс Перегрин", "фантастика", 2016, 126),
            Movie(120,"Властелин колец: Братство кольца", "фантастика", 2001, 179),
            Movie(561,"Константин", "фантастика", 2005, 121)
    )


    fun getDefault() = mutableListOf(
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0),
                Movie(0,"", "", 0,0)
        )

